In [1]:
import pandas as pd

In [2]:
Player_Salary_CSV = '../../alec-work/output_csv/final_salaries_team_names_1985_to_2015.csv'
player_salary_df = pd.read_csv(Player_Salary_CSV)

player_salary_df.head()

   yearID teamID lgID   playerID  salary            name franchID
0    1985    ATL   NL  barkele01  870000  Atlanta Braves      ATL
1    1985    ATL   NL  bedrost01  550000  Atlanta Braves      ATL
2    1985    ATL   NL  benedbr01  545000  Atlanta Braves      ATL
3    1985    ATL   NL   campri01  633333  Atlanta Braves      ATL
4    1985    ATL   NL  ceronri01  625000  Atlanta Braves      ATL

In [3]:
new_df = player_salary_df.loc[player_salary_df['yearID'] == 1985]

In [4]:
grouped = new_df.groupby(['teamID'])
salary_1985 = grouped['salary'].sum()

#salary_1985_df = pd.Dataframe(salary_1985)

salary_df = pd.DataFrame(salary_1985)
salary_df.rename(columns={'teamID':'Team ID'})

          salary
teamID
ATL     14807000
BAL     11560712
BOS     10897560
CAL     14427894
CHA      9846178
CHN     12702917
CIN      8359917
CLE      6551666
DET     10348143
HOU      9993051
KCA      9321179
LAN     10967917
MIN      5764821
ML4     11284107
MON      9470166
NYA     14238204
NYN     10834762
OAK      9058606
PHI     10124966
PIT      9227500
SDN     11036583
SEA      4613000
SFN      8221714
SLN     11817083
TEX      7676500
TOR      8812550

In [5]:
teams_info = 'Cleaned_Teams_info.csv'
teams_info_df = pd.read_csv(teams_info)
rename_df = teams_info_df.rename(columns={'Team ID':'teamID'})

In [6]:
new_df_1  = rename_df.loc[rename_df['Year'] == 1985]
new_df_1.head(50)
final_team_df = new_df_1.set_index('teamID')

In [7]:
total_salary_per_team_df = final_team_df.join(salary_df)

total_salary_per_team_df

        Unnamed: 0  Year              Team Name  Games  Wins  Loses    salary
teamID
ATL              0  1985         Atlanta Braves    162    66     96  14807000
BAL              1  1985      Baltimore Orioles    161    83     78  11560712
BOS              2  1985         Boston Red Sox    163    81     81  10897560
CAL              3  1985      California Angels    162    90     72  14427894
CHA              4  1985      Chicago White Sox    163    85     77   9846178
CHN              5  1985           Chicago Cubs    162    77     84  12702917
CIN              6  1985        Cincinnati Reds    162    89     72   8359917
CLE              7  1985      Cleveland Indians    162    60    102   6551666
DET              8  1985         Detroit Tigers    161    84     77  10348143
HOU              9  1985         Houston Astros    162    83     79   9993051
KCA             10  1985     Kansas City Royals    162    91     71   9321179
LAN             11  1985    Los Angeles Dodgers    162    95     67  10967917
MIN             12  1985        Minnesota Twins    162    77     85   5764821
ML4             13  1985      Milwaukee Brewers    161    71     90  11284107
MON             14  1985         Montreal Expos    161    84     77   9470166
NYA             15  1985       New York Yankees    161    97     64  14238204
NYN             16  1985          New York Mets    162    98     64  10834762
OAK             17  1985      Oakland Athletics    162    77     85   9058606
PHI             18  1985  Philadelphia Phillies    162    75     87  10124966
PIT             19  1985     Pittsburgh Pirates    161    57    104   9227500
SDN             20  1985       San Diego Padres    162    83     79  11036583
SEA             21  1985       Seattle Mariners    162    74     88   4613000
SFN             22  1985   San Francisco Giants    162    62    100   8221714
SLN             23  1985    St. Louis Cardinals    162   101     61  11817083
TEX             24  1985          Texas Rangers    161    62     99   7676500
TOR             25  1985      Toronto Blue Jays    161    99     62   8812550

In [8]:
total_salary_per_team_df.to_csv('1985_team_salary.csv')